---
title: BarTypeDiameterOptions
classe: Autodesk.Revit.DB.BarTypeDiameterOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# BarTypeDiameterOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BarModelDiameter { get; set; }` | `barTypeDiameterOptions.BarModelDiameter` | Double |
| `Double BarNominalDiameter { get; set; }` | `barTypeDiameterOptions.BarNominalDiameter` | Double |
| `Boolean IsValidObject { get; }` | `barTypeDiameterOptions.IsValidObject` | Boolean |
| `Double StandardBendDiameter { get; set; }` | `barTypeDiameterOptions.StandardBendDiameter` | Double |
| `Double StandardHookBendDiameter { get; set; }` | `barTypeDiameterOptions.StandardHookBendDiameter` | Double |
| `Double StirrupTieBendDiameter { get; set; }` | `barTypeDiameterOptions.StirrupTieBendDiameter` | Double |
| `Void Dispose()` | `barTypeDiameterOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```